'''
2. 리스트 ['H', 'e', 'l', 'l', 'o', ',', ' ', 'I', 'o', 'T']에 대해 슬라이싱과
함수(메소드 포함)를 이용하여 아래와 같이 수행하는 프로그램을 작성하라. (10점)
A. 리스트 마지막에 '!'를 추가한 후 출력하라.
B. 다섯 번째 요소('o')를 제거한 후 출력하라.
C. 인덱스 4에 'a'를 넣은 후 출력하라.
D. 리스트를 문자열로 변환하여 출력하라.
E. 리스트를 오름차순으로 정렬하여 출력하라.
주의사항 
- 리스트는 별도 입력 받을 필요없이 변수 lst에 저장하여 사용
- 반복문 사용 불가
출력 결과 ['H', 'e', 'l', 'l', 'o', ',', ' ', 'I', 'o', 'T', '!']
['H', 'e', 'l', 'l', ',', ' ', 'I', 'o', 'T', '!']
['H', 'e', 'l', 'l', 'a', ',', ' ', 'I', 'o', 'T', '!']
Hella, IoT!
['o', 'l', 'l', 'e', 'a', 'T', 'I', 'H', ',', '!', ' ']
'''
lst = ['H', 'e', 'l', 'l', 'o', ',', ' ', 'I', 'o', 'T']
# A
lst.append('!')
print(lst)
# B
del lst[4]
print(lst)
# C
lst.insert(4,'a')
# D
str = ''.join(lst)
print(str)
# E
lst.sort(reverse=True)
print(lst)